In [3]:
#load data
import pandas as pd

df = pd.read_excel("titanic3.xls")

df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
#total passengers and assess missing data

df.count()

pclass       1309
survived     1309
name         1309
sex          1309
age          1046
sibsp        1309
parch        1309
ticket       1309
fare         1308
cabin         295
embarked     1307
boat          486
body          121
home.dest     745
dtype: int64

In [5]:
#drop columns that are less relevant for analysis such as boat, body, home, ticket
df.drop(['cabin','boat','body','home.dest', 'ticket'], axis=1, inplace=True)

df.head()

,pclass,survived,name,sex,age,sibsp,parch,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,211.3375,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,151.5500,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,151.5500,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,151.5500,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,151.5500,S

In [6]:
df.count()

pclass      1309
survived    1309
name        1309
sex         1309
age         1046
sibsp       1309
parch       1309
fare        1308
embarked    1307
dtype: int64

In [8]:
#drop rows with missing data in the variables of interest
df_no_missing = df.dropna()
df_no_missing.count()

pclass      1043
survived    1043
name        1043
sex         1043
age         1043
sibsp       1043
parch       1043
fare        1043
embarked    1043
dtype: int64

In [9]:
df_no_missing.head()

,pclass,survived,name,sex,age,sibsp,parch,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,211.3375,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,151.5500,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,151.5500,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,151.5500,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,151.5500,S

In [22]:
#look at overall numbers survival

df_no_missing.groupby('survived').count()

          pclass  name  sex  age  sibsp  parch  fare  embarked  agr_cat
survived
0            618   618  618  618    618    618   618       618      618
1            425   425  425  425    425    425   425       425      425

In [23]:
#look at averages in the survivors and non-survivors
df_no_missing.groupby('survived').mean()

            pclass        age     sibsp     parch       fare
survived
0         2.430421  30.496899  0.512945  0.341424  25.148752
1         1.887059  28.819020  0.491765  0.538824  53.258883

In [10]:
#find age upper limit
df_no_missing['age'].max()

80.0

In [12]:
#create bins dividers for the age variable
bins = [0, 18, 65, 80]

#name the groups
age_group_names = ['child','adult','senior']

In [13]:
df_no_missing['agr_cat'] = pd.cut(df['age'], bins, labels=age_group_names)
df_no_missing.head()

C:\Users\user\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,pclass,survived,name,sex,age,sibsp,parch,fare,embarked,agr_cat
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,211.3375,S,adult
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,151.5500,S,child
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,151.5500,S,child
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,151.5500,S,adult
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,151.5500,S,adult

In [20]:
#count data bt age group
df_no_missing.groupby('agr_cat').count()

         pclass  survived  name  sex  age  sibsp  parch  fare  embarked
agr_cat
adult       840       840   840  840  840    840    840   840       840
child       193       193   193  193  193    193    193   193       193
senior       10        10    10   10   10     10     10    10        10

In [35]:
# overall numbers of survivors and deaths
df_no_missing.groupby('survived').count()

          pclass  name  sex  age  sibsp  parch  fare  embarked  agr_cat
survived
0            618   618  618  618    618    618   618       618      618
1            425   425  425  425    425    425   425       425      425

In [33]:
#survival rate overall
df_no_missing['survived'].mean()

0.4074784276126558

In [32]:
#means for other variables among survivors
df_no_missing.loc[df['survived']==1].mean()

pclass       1.887059
survived     1.000000
age         28.819020
sibsp        0.491765
parch        0.538824
fare        53.258883
dtype: float64

In [21]:
#survived rates by age group
df_no_missing.groupby('agr_cat')['survived'].mean()

agr_cat
adult     0.390476
child     0.492228
senior    0.200000
Name: survived, dtype: float64

In [24]:
#survived data by sex
df_no_missing.groupby('sex')['survived'].mean()

sex
female    0.751295
male      0.205479
Name: survived, dtype: float64

In [25]:
#survived data by passenger class
df_no_missing.groupby('pclass')['survived'].mean()

pclass
1    0.634752
2    0.440613
3    0.262000
Name: survived, dtype: float64

In [26]:
#survived by embarkment city
df_no_missing.groupby('embarked')['survived'].mean()

embarked
C    0.622642
Q    0.260000
S    0.358515
Name: survived, dtype: float64

In [27]:
#surived by number of parents or children onboard
df_no_missing.groupby('parch')['survived'].mean()

parch
0    0.350327
1    0.593750
2    0.567010
3    0.625000
4    0.200000
5    0.166667
6    0.000000
Name: survived, dtype: float64

In [28]:
#surived by number of siblings or spouses onboard
df_no_missing.groupby('sibsp')['survived'].mean()

sibsp
0    0.370968
1    0.525000
2    0.444444
3    0.375000
4    0.136364
5    0.000000
8    0.000000
Name: survived, dtype: float64